{"weightsManifest": [{"weights": [{"shape": [2], "name": "Variable_15", "dtype": "float32"}, {"shape": [128, 2], "name": "Variable_14", "dtype": "float32"}, {"shape": [128], "name": "Variable_13", "dtype": "float32"}, {"shape": [196, 128], "name": "Variable_12", "dtype": "float32"}, {"shape": [], "name": "concat_1/axis", "dtype": "int32"}, {"shape": [64], "name": "Variable_11", "dtype": "float32"}, {"shape": [128, 64], "name": "Variable_10", "dtype": "float32"}, {"shape": [128], "name": "Variable_9", "dtype": "float32"}, {"shape": [10816, 128], "name": "Variable_8", "dtype": "float32"}, {"shape": [2], "name": "Reshape_1/shape", "dtype": "int32"}, {"shape": [64], "name": "Variable_7", "dtype": "float32"}, {"shape": [5, 5, 32, 64], "name": "Variable_6", "dtype": "float32"}, {"shape": [32], "name": "Variable_5", "dtype": "float32"}, {"shape": [5, 5, 3, 32], "name": "Variable_4", "dtype": "float32"}, {"shape": [128], "name": "Variable_3", "dtype": "float32"}, {"shape": [10400, 128], "name": "Variable_2", "dtype": "float32"}, {"shape": [2], "name": "Reshape/shape", "dtype": "int32"}, {"shape": [32], "name": "Variable_1", "dtype": "float32"}, {"shape": [5, 5, 3, 32], "name": "Variable", "dtype": "float32"}], "paths": ["group1-shard1of3", "group1-shard2of3", "group1-shard3of3"]}], "modelTopology": {"library": {}, "node": [{"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "x_info", "op": "Placeholder"}, {"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "50"}, {"size": "50"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "x_face", "op": "Placeholder"}, {"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "25"}, {"size": "50"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "x0", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_15", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_14", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_13", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "196"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_12", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "name": "concat_1/axis", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_11", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_10", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_9", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "10816"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_8", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}, "name": "Reshape_1/shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_7", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_6", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_5", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_4", "op": "Const"}, {"attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}, "name": "keep_prob_face", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "10400"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_2", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}, "name": "Reshape/shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "name": "Variable", "op": "Const"}, {"attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}, "name": "keep_prob_eye", "op": "Placeholder"}, {"attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}, "name": "keep_prob", "op": "Placeholder"}, {"input": ["x_face", "Variable_4"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "Conv2D_1", "op": "Conv2D"}, {"input": ["x0", "Variable"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "Conv2D", "op": "Conv2D"}, {"input": ["Conv2D_1", "Variable_5"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_2", "op": "Add"}, {"input": ["Conv2D", "Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add", "op": "Add"}, {"input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Relu_1", "op": "Relu"}, {"input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Relu", "op": "Relu"}, {"input": ["Relu_1"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}, "name": "MaxPool_1", "op": "MaxPool"}, {"input": ["Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}, "name": "MaxPool", "op": "MaxPool"}, {"input": ["MaxPool_1", "Variable_6"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "Conv2D_2", "op": "Conv2D"}, {"input": ["MaxPool", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape", "op": "Reshape"}, {"input": ["Conv2D_2", "Variable_7"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_3", "op": "Add"}, {"input": ["Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "name": "dropout/Shape", "op": "Shape"}, {"input": ["Reshape", "keep_prob_eye"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout/div", "op": "RealDiv"}, {"input": ["add_3"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Relu_2", "op": "Relu"}, {"input": ["dropout/Shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}}, "name": "dropout/random_uniform/RandomUniform", "op": "RandomUniform"}, {"input": ["Relu_2"], "attr": {"padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "MaxPool_2", "op": "MaxPool"}, {"input": ["keep_prob_eye", "dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout/add", "op": "Add"}, {"input": ["MaxPool_2", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape_1", "op": "Reshape"}, {"input": ["dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout/Floor", "op": "Floor"}, {"input": ["Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "name": "dropout_1/Shape", "op": "Shape"}, {"input": ["Reshape_1", "keep_prob_face"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_1/div", "op": "RealDiv"}, {"input": ["dropout/div", "dropout/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout/mul", "op": "Mul"}, {"input": ["dropout_1/Shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}}, "name": "dropout_1/random_uniform/RandomUniform", "op": "RandomUniform"}, {"input": ["dropout/mul", "Variable_2"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "name": "MatMul", "op": "MatMul"}, {"input": ["keep_prob_face", "dropout_1/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_1/add", "op": "Add"}, {"input": ["MatMul", "Variable_3"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_1", "op": "Add"}, {"input": ["dropout_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_1/Floor", "op": "Floor"}, {"input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Tanh", "op": "Tanh"}, {"input": ["dropout_1/div", "dropout_1/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_1/mul", "op": "Mul"}, {"input": ["dropout_1/mul", "Variable_8"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "name": "MatMul_1", "op": "MatMul"}, {"input": ["MatMul_1", "Variable_9"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_4", "op": "Add"}, {"input": ["add_4"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Tanh_1", "op": "Tanh"}, {"input": ["Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "name": "dropout_2/Shape", "op": "Shape"}, {"input": ["Tanh_1", "keep_prob_face"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_2/div", "op": "RealDiv"}, {"input": ["dropout_2/Shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}}, "name": "dropout_2/random_uniform/RandomUniform", "op": "RandomUniform"}, {"input": ["keep_prob_face", "dropout_2/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_2/add", "op": "Add"}, {"input": ["dropout_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_2/Floor", "op": "Floor"}, {"input": ["dropout_2/div", "dropout_2/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_2/mul", "op": "Mul"}, {"input": ["dropout_2/mul", "Variable_10"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "name": "MatMul_2", "op": "MatMul"}, {"input": ["MatMul_2", "Variable_11"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_5", "op": "Add"}, {"input": ["add_5"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Tanh_2", "op": "Tanh"}, {"input": ["Tanh", "Tanh_2", "x_info", "concat_1/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}, "name": "concat_1", "op": "ConcatV2"}, {"input": ["concat_1", "Variable_12"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "name": "MatMul_3", "op": "MatMul"}, {"input": ["MatMul_3", "Variable_13"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_6", "op": "Add"}, {"input": ["add_6"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Tanh_3", "op": "Tanh"}, {"input": ["Tanh_3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "name": "dropout_3/Shape", "op": "Shape"}, {"input": ["Tanh_3", "keep_prob"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_3/div", "op": "RealDiv"}, {"input": ["dropout_3/Shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}}, "name": "dropout_3/random_uniform/RandomUniform", "op": "RandomUniform"}, {"input": ["keep_prob", "dropout_3/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_3/add", "op": "Add"}, {"input": ["dropout_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_3/Floor", "op": "Floor"}, {"input": ["dropout_3/div", "dropout_3/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "dropout_3/mul", "op": "Mul"}, {"input": ["dropout_3/mul", "Variable_14"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "name": "MatMul_4", "op": "MatMul"}, {"input": ["MatMul_4", "Variable_15"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_7", "op": "Add"}, {"input": ["add_7"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "model", "op": "Tanh"}], "versions": {"minConsumer": 12}}}